dayuer/esp-airprint/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 控制台必须走 UART0（Micro-USB 调试口）：
# USB-OTG 外设被 host 模式占用后，原生 USB-Serial/JTAG 与之共用 GPIO19/20，用不了
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# 诊断用：把日志同时镜像到原生 USB-Serial/JTAG，
# 这样在切进 host 模式（PHY 被 OTG 接管）之前的输出能从 DEV 口看到
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 崩溃取证：coredump 写 flash，事后 idf.py coredump-info 读回溯
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# TCP 缓冲：这两个值是【本地 IPP 时代】定下的，当时要给 iOS 的 8 条并发连接省内存
# （每条各一份收发缓冲，按 5760 算一条约 11KB，8 条 88KB 直接吃光堆），
# 而 IPP 请求只有 268 字节，2×MSS 绰绰有余。
#
# 云架构下前提变了：只剩一条 HTTPS 下载连接，没有并发压力，而窗口大小直接
# 决定取件速度。2880 很可能已经是瓶颈而不是保护。
# ⚠ 待验证：调大到 5760/11520 测端到端取件耗时与空闲堆，确认后再改这里。
CONFIG_LWIP_TCP_WND_DEFAULT=2880
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_RECVMBOX_SIZE=12

# socket 池：默认 10 个。现在的用量是 MQTT + HTTPS 取件 + netlog + 配网期的 httpd，
# 远没到上限；保持 16 是余量，不是必需。
CONFIG_LWIP_MAX_SOCKETS=16

# Wi-Fi 缓冲默认按高吞吐场景配，我们是低流量设备（请求 268 字节、应答 4.7KB），
# 省下来的几十 KB 正好给 iOS 的多条并发连接用。
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# 曾经在这里抬 mDNS 任务优先级来对抗 iOS 轮询把它饿死。云架构下已不再编译
# mDNS 组件（dependencies.lock 里没有它），那两行是空配置，已删除。
# 那次教训本身记在 docs/HANDOFF-cloud-print.md 第 2 节。
